import matplotlib.pyplot as plt

x = [1,
     2,
     3,
     4,
     5,
     6,
     7,
     8,
     9,
     10,
     11,
     12,
     13,
     14, ]
y = [0.49456631294985387, 0.42443047000723544, 0.3905005057562933, 0.4100893002513906, 0.40576004881930017,
     0.4055777720001144,
     0.45365089735808517, 0.47408920465784665, 0.4221712008415246, 0.41133044653783957, 0.42092456548187335,
     0.4639300096255341, 0.4648674278187062, 0.44119057768015413]

plt.plot(x,  # x轴数据
         y,  # y轴数据
         linestyle='-',  # 折线类型
         linewidth=2,  # 折线宽度
         color='steelblue',  # 折线颜色
         marker='o',  # 折线图中添加圆点
         markersize=6,  # 点的大小
         markeredgecolor='black',  # 点的边框色
         markerfacecolor='brown',  # 点的填充色
         )
# 对于X轴，只显示x中各个数对应的刻度值
plt.xticks(fontsize=8, )  # 改变x轴文字值的文字大小
# 添加y轴标签
plt.ylabel('Coherence')
# 添加图形标题
plt.title('num of topics')
# 显示图形
plt.show()
